Repository: 84000/data-translation-memory
Catalog: toh129-v4.tmx
Source language: bo
Languages: en

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་སྨོན་ལམ་དང་བདག་གི་སྤྱོད་པ་དང་སྨོན་ལམ་ཡང་དག་པར་སྐྱེད་ཅིང་ཆོས་ཀྱི་སྣང་བ་རབ་ཏུ་གཏོང་བ་ལ་མཁས་པ།
en: They were skilled in engendering the aspirations of all buddhas and bodhisattvas as well as their own conduct and aspirations. They were skilled in shining the light of Dharma.

source: རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་གཅིག་ལ་བསྐལ་པ་དང་འཇིག་རྟེན་གྱི་ཁམས་བརྗོད་དུ་མེད་པ་ལ་འཇུག་པ་ལ་མཁས་པ།
en: They were skilled in entering into inexpressibly numerous eons and world systems within a single atom.

source: རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་གཅིག་ལ་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་ཚད་ཙམ་གྱིས་སངས་རྒྱས་ཀྱི་ཞིང་གཅིག་ཀུན་ཏུ་སྟོན་པ་ལ་མཁས་པ།
en: They were skilled in causing a buddha realm the size of all the universes to be seen within a single atom.

source: མཚོ་ཆེན་པོ་རྒྱ་མཚོའི་ཆུའི་ཕུང་པོ་ཐམས་ཅད་སྤུའི་ཁུང་བུ་གཅིག་ཏུ་བཅུག་སྟེ།
en: They could make all the water in all the oceans fit within a single pore of the skin.

source: ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚད་ཙམ་གྱི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་འགྲོ་ཡང་སེམས་ཅན་རྣམས་ལ་གནོད་པ་མེད་པ་ལ་མཁས་པ།
en: They were skilled in going to all the world systems throughout the extent of the realm of phenomena while doing no harm to beings.

source: འཇིག་རྟེན་གྱི་ཁམས་བརྗོད་དུ་མེད་པ་རང་གི་ལུས་སུ་འཇུག་ཅིང་སེམས་ཅན་གྱི་བྱ་བ་ཐམས་ཅད་ཀུན་ཏུ་སྟོན་པ་ལ་མཁས་པ།
en: They were skilled in absorbing inexpressibly numerous world systems into their own bodies and causing the diverse activities of beings to be seen.

source: ཁོར་ཡུག་དང་ཁོར་ཡུག་ཆེན་པོ་དང་རི་ཆེན་པོ་གཞན་གྲངས་མེད་ཅིང་བསམ་གྱིས་མི་ཁྱབ་ལ་མཚུངས་པ་མེད་ཅིང་གཞལ་དུ་མེད་དེ་ཚད་མེད་ལ་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པ་དག་སྤུའི་ཁུང་བུ་གཅིག་ཏུ་བཅུག་སྟེ།
en: They could make the surrounding mountains, the greater surrounding mountains, and other huge mountains—incalculable, inconceivable, incomparable, immeasurable, limitless, and absolutely inexpressible—fit within a single pore.

source: ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚད་ཙམ་གྱིས་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་འགྲོ་ཡང་སེམས་ཅན་རྣམས་སྐྲག་པར་མི་འགྱུར་བ་ལ་མཁས་པ།
en: Thus, they were skilled in going to all the world systems throughout the extent of the realm of phenomena while not frightening beings in any way.

source: བསྐལ་པ་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པ་བསྐལ་པ་གཅིག་ཏུ་བྱིན་གྱིས་རློབ་ཅིང་བསྐལ་པ་གཅིག་ཀྱང་འཇིག་པ་དང་འཆགས་པའི་བསྐལ་པ་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པར་ཀུན་ཏུ་སྟོན་པ་ལ་མཁས་པ།
en: They were skilled in transforming inexpressibly numerous eons into a single eon and in displaying one eon as inexpressibly numerous eons of destruction and formation.

source: འདུལ་བ་ཇི་ལྟ་བ་བཞིན་དུ་སེམས་ཅན་ཐམས་ཅད་ལ་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཆུས་འཇིག་པ་དང་མེས་འཇིག་པ་དང་རླུང་གིས་འཇིག་པར་ཀུན་ཏུ་སྟོན་པ་ལ་མཁས་པ།
en: In order to properly train others, they were skilled in causing all beings to see how all world systems will be destroyed by water, fire, and wind.

source: འཇིག་རྟེན་གྱི་ཁམས་གྲངས་མེད་བསམ་གྱིས་མི་ཁྱབ་པ་རྐང་པའི་མཐེ་བོས་མནན་ཀྱང་སེམས་ཅན་ལ་གནོད་པ་མེད་པར་མཁས་པ་ཤ་སྟག་གོ།
en: Though they could crush uncountable and inconceivable world systems with their big toes, every one of them was skilled in not bringing harm to beings.

source: །ཐམས་ཅད་ཀྱང་ཆོས་ཀྱི་སྤྲིན་གྱིས་ཐོབ་པ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་སེམས་ཅན་རྣམས་ལ་འདུལ་བ་ཇི་ལྟ་བ་བཞིན་དུ་འཚེ་བ་དང་བཅས་པ་དང་། གནོད་པ་དང་བཅས་པ་དང་མུ་གེའི་མྱ་ངན་ཆེན་པོ་བྱིན་གྱིས་རློབ་པ་ཀུན་ཏུ་སྟོན་པ་ལ་མཁས་པ།
en: They had all gained attainment by means of the cloud of Dharma, and they were skilled in displaying the transformation of great suffering, in the form of harm, injury, and famine, to train beings in all the worlds of the ten directions.

source: སེམས་ཅན་གཞན་ལ་རྣམ་པར་འཚེ་བ་མེད་པ་མངོན་པར་ཤེས་པ་སངས་རྒྱས་མི་བཞུགས་པའི་འཇིག་རྟེན་གྱི་ཁམས་སུ་སངས་རྒྱས་འབྱུང་བར་ཀུན་ཏུ་སྟོན་པ་ཤ་སྟག་སྟེ།
en: They did not harm other beings. Every one of them had the superknowledges and could cause the appearance of buddhas to be seen in world systems where no buddhas had come.

source: བཟང་སྐྱོང་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་ལྔ་བརྒྱ་ཐམས་ཅད་ཀྱང་ཕྱིར་མི་ལྡོག་པ་ཤ་སྟག་གོ།
en: There were also five hundred bodhisattvas, such as Bhadrapāla, every one of whom had reached the level from which there is no regression.

source: །ཡང་དེའི་ཚེ་ཡངས་པ་ཅན་གྱི་གྲོང་ཁྱེར་ཆེན་པོ་ནས་ལིཙྪ་བཱི་གཞོན་ནུ་དཀོན་མཆོག་འབྱུང་གནས་ཞེས་བྱ་བ་ལིཙྪ་བཱི་གཞོན་ནུ་ཉི་ཁྲི་ཆིག་སྟོང་གིས་ཡོངས་སུ་བསྐོར་ཏེ་མདུན་དུ་བདར་ནས་ལྷན་ཅིག་ཏུ་བྱ་རྒོད་ཀྱི་ཕུང་པོ་རི་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་པ་དང་།
en: At that same time, too, the Licchavi youth Ratnākara arrived at Vulture Peak from the city of Vaiśālī surrounded and venerated by a group of twenty-one thousand Licchavi youths.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ།གཡས་ཕྱོགས་ལོགས་སུ་འདུག་ནས་ཐམས་ཅད་ཀྱང་མིག་མི་འཛུམས་པར་བཅོམ་ལྡན་འདས་ལ་ལྟ་ཞིང་འཁོད་པར་གྱུར་ཏོ།
en: They bowed their heads to the feet of the Blessed One and took their place to his right side. There they stayed, gazing upon him with unblinking eyes.

source: །ག་ཡཱའི་གྲོང་ཁྱེར་ཆེན་པོ་ནས་ཁྱིམ་བདག་སྔོ་སངས་ཅན་ཞེས་བྱ་བ་དགེ་བསྙེན་ལྔ་བརྒྱས་ཡོངས་སུ་བསྐོར་ཏེ་མདུན་དུ་བདར་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: The householder Śyāmaka came from the city of Gayā, surrounded and venerated by a group of five hundred laymen, to the place where the Blessed One was residing.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་མིག་མི་འཛུམས་པར་བཅོམ་ལྡན་འདས་ལ་ལྟ་ཞིང་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ།
en: They bowed their heads to the feet of the Blessed One. Then, taking their place to one side, they all gazed upon the Blessed One with unblinking eyes.

source: །ཁྱིམ་བདག་བཟང་སྐྱོང་ཡང་ཁྱིམ་བདག་ལྔ་སྟོང་གིས་ཡོངས་སུ་བསྐོར་ཏེ་མདུན་དུ་བདར་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: The householder Bhadrapāla also came surrounded and venerated by a group of five thousand householders to the place where the Blessed One was residing.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་ཐམས་ཅད་ཀྱང་མིག་མི་འཛུམས་པར་བཅོམ་ལྡན་འདས་ལ་ལྟ་ཞིང་འཁོད་པར་གྱུར་ཏོ།
en: They bowed their heads to the feet of the Blessed One. Then, taking their place to one side, they all gazed upon the Blessed One with unblinking eyes.

source: །ཁྱིམ་བདག་ལེགས་སྦྱིན་ཡང་ཁྱིམ་བདག་ལྔ་སྟོང་གིས་ཡོངས་སུ་བསྐོར་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ།
en: The householder Sudatta came surrounded and venerated by a group of five thousand householders to the place where the Blessed One was residing. They bowed their heads to the feet of the Blessed One.

source: ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་ཐམས་ཅད་མིག་མི་འཛུམས་པར་བཅོམ་ལྡན་འདས་ལ་ལྟ་ཞིང་འཁོད་པར་གྱུར་ཏོ།
en: Then, taking their place to one side, they all gazed upon the Blessed One with unblinking eyes.

source: །ཁྱིམ་བདག་དེད་དཔོན་བཟང་པོ་ཡང་གཡོག་མང་པོ་དང་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: The householder Susārthavāha came with many servants to the place where the Blessed One was residing.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་བཅོམ་ལྡན་འདས་ལ་མིག་མི་འཛུམས་པར་ལྟ་ཞིང་འདུག་གོ།
en: They bowed their heads to the feet of the Blessed One. Then, taking their place to one side, they all gazed upon the Blessed One with unblinking eyes.

source: །ཙམ་པའི་གྲོང་ཁྱེར་ཆེན་པོ་ནས་ཀྱང་ཚོང་དཔོན་གྱི་བུ་ལག་བཟང་ཚོང་དཔོན་གྱི་བུ་བརྒྱད་ཁྲི་བཞི་སྟོང་གིས་ཡོངས་སུ་བསྐོར་ཏེ་མདུན་དུ་བདར་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་
en: The merchant Subāhu came from the city of Campā surrounded and venerated by a group of eighty-four thousand merchants to the place where the Blessed One was residing.

source: །བྲམ་ཟེའི་ཁྱེའུ་མིས་བྱིན་ཡང་བྲམ་ཟེའི་ཁྱེའུ་ལྔ་བརྒྱས་ཡོངས་སུ་བསྐོར་ཏེ་མདུན་དུ་བདར་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་པ་དང་།
en: The brahmin youth Naradatta came surrounded and venerated by a group of five hundred Brahmin youths to the place where the Blessed One was residing.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་ཐམས་ཅད་ཀྱང་བཅོམ་ལྡན་འདས་ལ་མིག་མི་འཛུམས་པར་ལྟ་ཞིང་འཁོད་པར་གྱུར་ཏོ།
en: They bowed their heads to the feet of the Blessed One. Then, taking their place to one side, they all gazed upon the Blessed One with unblinking eyes.

source: །བྲམ་ཟེའི་ཁྱེའུ་དགའ་བའི་ཟླ་བ་ཡང་གཡོག་བྲམ་ཟེའི་ཁྱེའུ་ལྔ་བརྒྱ་དང་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་པ་དང་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་བཅོམ་ལྡན་འདས་ལ་མིག་མི་འཛུམས་པར་ལྟ་ཞིང་འདུག་གོ།
en: The brahmin youth Nandicandra came attended by five hundred Brahmin youths to the place where the Blessed One was residing. They bowed their heads to the feet of the Blessed One. Then, taking their place to one side, they all gazed upon the Blessed One with unblinking eyes.

source: །ལུས་འཕགས་མོའི་བུ་ཡུལ་མ་ག་དྷཱའི་རྒྱལ་པོ་མ་སྐྱེས་དགྲ་ཡང་སྲོག་ཆགས་ལྔ་སྟོང་གིས་ཡོངས་སུ་བསྐོར་ཏེ་མདུན་དུ་བདར་ནས་གླང་པོའི་དབང་པོ་ནོར་སྐྱོང་ལ་ཞོན་ཏེ་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་ནས་དེ་བཞོན་དུ་རུང་བའི་ས་ཇི་ཙམ་པ་དེ་ཙམ་དུ་ནོར་སྐྱོང་ལ་ཞོན་ཏེ། ཁང་བུ་བརྩེགས་མས་སོང་ནས་བཞོན་པ་ལས་བབས་ཏེ་
en: King Ajātaśatru of Magadha, son of Vaidehī, riding the king of elephants Dhanapāla, arrived where the Blessed One was residing along with a retinue of five thousand beings who surrounded and venerated the king. He rode Dhanapāla as far as was fitting and then dismounted from his palanquin.

source: རྐང་གིས་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལ་འཛེགས་ནས།བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་པ་དང་
en: He then ascended Vulture Peak on foot and arrived before the Blessed One.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ།སྲོག་ཆགས་ལྔ་སྟོང་དང་ལྷན་ཅིག་ཏུ་ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་བཅོམ་ལྡན་འདས་ལ་མིག་མི་འཛུམས་པར་ལྟ་ཞིང་འདུག་གོ།
en: He bowed his head to the feet of the Blessed One and then took his place to one side along with all five thousand beings in his retinue. They all gazed upon the Blessed One with unblinking eyes.

source: །གྲོང་ཁྱེར་ཆེན་པོ་བཱ་རཱ་ཎ་སཱི་ནས་ཚོང་དཔོན་གྱི་བུ་ཡུལ་འཁོར་བཟང་པོ་ཞེས་བྱ་བ་ཡང་ཚོང་དཔོན་གྱི་བུ་ལྔ་བརྒྱས་ཡོངས་སུ་བསྐོར་ཏེ་མདུན་དུ་བདར་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་བཅོམ་ལྡན་འདས་ལ་མིག་མི་འཛུམས་པར་ལྟ་ཞིང་འདུག་གོ།
en: The merchant Surāṣṭra came from the city of Vārāṇasī surrounded and venerated by a group of five hundred merchants to the place where the Blessed One was residing. They bowed their heads to the feet of the Blessed One. Then, taking their place to one side, they all gazed upon the Blessed One with unblinking eyes.

source: །ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དང་མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ་དང་འཇིག་རྟེན་སྐྱོང་བ་བཞི་དང་ལྷའི་བུ་དབང་ཕྱུག་ཆེན་པོ་དང་ལྷའི་བུ་ཟླ་བ་དང་། ལྷའི་བུ་ཤིན་ཏུ་རྣམ་པར་གནོན་སེམས་དང་། ལྷའི་བུ་མཚན་བཟང་དང་། ལྷའི་བུ་གཞན་ཡང་བསམ་གྱིས་མི་ཁྱབ་མཚུངས་པ་མེད་གཞལ་དུ་མེད་དཔག་ཏུ་མེད། ཚད་མེད་པ་དག་ལྷའི་བུ་རེ་རེ་ལ་ཡང་གཡོག་ལྷའི་བུ་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་བརྒྱ་སྟོང་དང་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ལྷགས་ནས།
en: Śakra, who is the lord of the gods, Brahmā, who is the lord of the Sahā world, the four guardians of the world, the god Maheśvara, the god Candra, the god Suvikrāntamati, the god Sulakṣaṇa, and an inconceivable, incomparable, immeasurable, unfathomable, and limitless number of other gods, each with billions of their own divine attendants, came to the place where the Blessed One was residing.

source: ལྷའི་བུ་རེ་རེས་ཀྱང་བཅོམ་ལྡན་འདས་ལ་ཚུལ་དང་འཐུན་པའི་མཆོད་པ་བསམ་གྱིས་མི་ཁྱབ་པ་བྱས་ཏེ།
en: They each made an inconceivable number of suitable offerings to the Blessed One.

source: ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་ཐམས་ཅད་ཀྱང་བཅོམ་ལྡན་འདས་ལ་མིག་མི་འཛུམས་པར་ལྟ་ཞིང་འཁོད་པར་གྱུར་ཏོ།
en: Then, taking their place to one side, they all gazed upon the Blessed One with unblinking eyes.

source: །ཡང་དེའི་ཚེ་བཅོམ་ལྡན་འདས་སྤུའི་ཁུང་བུ་རེ་རེ་དང་དཔེ་བྱད་བཟང་པོ་དང་མཚན་རེ་རེ་ནས་ཀྱང་སངས་རྒྱས་ཀྱི་ཞིང་བཅུའི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་ཀྱི་འོད་ཕྱུང་སྟེ།
en: At that time, from every pore of the Blessed One’s skin, and from each of his excellent signs and all his marks, the Blessed One emitted rays of light as numerous as all the atoms in ten buddha realms.

source: འོད་ཟེར་དེ་རེ་རེས་ཀྱང་ཕྱོག་བཅུའི་ཕྱོགས་རེ་རེར་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཕྲག་བཅུའི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་སྣང་བ་ཆེན་པོས་ཁྱབ་པར་བྱས་སོ།
en: Each light ray bathed in a bright light as many world systems as there are atoms in one hundred million buddha realms.

source: །འཇིག་རྟེན་གྱི་ཁམས་རེ་རེ་ནས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གྲངས་མེད་པ་འོངས་ཏེ།
en: The light caused countless quadrillions of bodhisattvas to arrive from each of these world systems.

source: བྱང་ཆུབ་སེམས་དཔའ་རེ་རེ་ཡང་རིན་པོ་ཆེའི་ཁང་པ་བརྩེགས་པ་ཆེན་པོ་ནང་རྒྱར་དཔག་ཚད་བྱེ་བ་བརྒྱ་སྟོང་ཡོད་པ། རིན་པོ་ཆེའི་ཁ་ཁྱེར་གྱིས་བསྐོར་བའི་ནོར་བུ་དང་མུ་ཏིག་དང་རིན་པོ་ཆེའི་ལྡ་ལྡིས་མཛེས་པར་བྱས་པ།
en: Each of the bodhisattvas had a jewel mansion measuring billions of leagues and adorned with gems, pearls, and jewel tassels around a bejeweled platform.

source: རྒྱལ་མཚན་དང་བ་དན་བསྒྲེང་བའི་ནང་ན་གནས་ཤིང་ལྷའི་བུ་མོ་བྱེ་བ་ཕྲག་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གྲངས་མེད་བསམ་གྱིས་མི་ཁྱབ་པས་ཡོངས་སུ་བསྐོར་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས། ལྷའི་མེ་ཏོག་གི་སྤྲིན་དང་རིན་པོ་ཆེའི་སྤྲིན་དང་ན་བཟའི་སྤྲིན་དང་། ཙན་དན་སྦྲུལ་གྱི་སྙིང་པོ་དང་ཨ་ག་རུ་དང་སྤོས་ཀྱི་སྤྲིན་དང་ལྷའི་རོལ་མོ་དང་། ཕེག་རྡོབ་པ་དང་གླུའི་སྤྲིན་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་ཚད་ཙམ་གཏོར་ནས་ཕྱོགས་གཅིག་ཏུ་འཁོད་དེ་བཅོམ་ལྡན་འདས་ལ་མིག་མི་འཛུམས་པར་ལྟ་ཞིང་འཁོད་པར་གྱུར་ཏོ།
en: Sitting below hoisted flags and banners and surrounded by uncountable quadrillions of divine maidens, they arrived at the place where the Blessed One was residing, scattering clouds of divine flowers, clouds of jewels, clouds of garments, clouds of sandalwood and agarwood incense, and clouds of divine instruments, cymbals, and song—clouds as large as world systems. Then, taking their place to one side, they all gazed upon the Blessed One with unblinking eyes.

source: །ཡང་དེའི་ཚེ་ན་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ཐ་ན་སྐྲའི་རྩེ་མོའི་ཆ་ཤས་ཀྱི་ཕྱོགས་ཙམ་ཡང་ལྷ་དང་ཀླུ་དང་གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་ལྷ་མ་ཡིན་དང་ནམ་མཁའ་ལྡིང་དང་མིའམ་ཅི་དང་ལྟོ་འཕྱེ་ཆེན་པོ་དང་། བརྒྱ་བྱིན་དང་ཚངས་པ་དང་འཇིག་རྟེན་སྐྱོང་བ་དང་། མི་དང་མི་མ་ཡིན་པ་དང་བྱང་ཆུབ་སེམས་དཔའ་རྒྱ་ཆེ་བ་རྒྱ་ཆེ་བ་དག་གིས་མ་ཁེབས་པར་གྱུར་པ་མེད་དོ་ཡང་
en: Throughout the great trichiliocosm there was no space, not even as much as a fraction of a single hair tip, that was not filled with gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, Śakra, Brahmā, world guardians, humans, nonhumans, or vast numbers of bodhisattvas.

source: དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་བཟང་སྐྱོང་ཞེས་བྱ་བ་སྟན་ལས་ལངས་ཏེ།བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ནས་
en: It was then that the bodhisattva Bhadrapāla stood up, draped his upper robe over one shoulder, and knelt on his right knee.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས།བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: With his palms together he bowed toward the Blessed One and made the following request:

source: །གལ་ཏེ་ཞུས་ནས་ཞུ་བ་ལུང་བསྟན་པའི་སླད་དུ་བཅོམ་ལྡན་འདས་ཀྱིས་བདག་ལ་སྐབས་ཕྱེ་ན་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལ་བདག་ཕྱོགས་འགའ་ཞིག་ཞུའོ།
en: “May I ask if the Blessed One might give me the opportunity to seek instruction? If so, there are a few points on which, blessed, thus-gone, worthy, perfect Buddha, I would request your clarification.”

source: །དེ་སྐད་ཅེས་གསོལ་པ་དང་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་བཟང་སྐྱོང་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །བཟང་སྐྱོང་ཁྱོད་ཅི་དང་ཅི་འདོད་པ་དྲིས་ཤིག་དང་ངས་དྲིས་པ་དེ་དང་དེའི་ལུང་བསྟན་པས་ཁྱོད་ཀྱི་སེམས་རངས་པར་བྱའོ། །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་།
en: The Blessed One replied to the bodhisattva Bhadrapāla, “Bhadrapāla, you may ask whatever you please. I will delight your mind by answering your question.”

source: བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་བཟང་སྐྱོང་གིས་འདི་སྐད་ཅེས་གསོལ་ཏོ།།བཅོམ་ལྡན་འདས་གནས་གང་དང་སྤྱོད་པ་ཇི་ལྟ་བུ་དང་ཚུལ་ཇི་ལྟ་བུ་དང་ཁྱད་པར་ཇི་ལྟ་བུ་དང་། དགེ་བའི་རྩ་བ་ཇི་ལྟ་བུ་དང་བརྩོན་འགྲུས་ཇི་ལྟ་བུ་དང་རབ་ཏུ་ཞི་བ་ཇི་ལྟ་བུ་དང་། ཡེ་ཤེས་ལ་མཁས་པ་ཇི་ལྟ་བུ་དང་དྲན་པ་ཇི་ལྟ་བུ་དང་རྟོགས་པ་ཇི་ལྟ་བུ་དང་བློ་གྲོས་ཇི་ལྟ་བུ་དང་། ཁྲེལ་མཆིས་པ་ཇི་ལྟ་བུ་དང་མོས་པ་ཇི་ལྟ་བུ་དང་། གོ་ཆ་ཇི་ལྟ་བུས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་སྟེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་མི་ཉམས་ཤིང་ཡོངས་སུ་མི་ཉམས་པ་ལགས།
en: So Bhadrapāla asked the Blessed One, “Blessed One, what are the basis, conduct, manner, distinction, roots of virtue, diligence, peace, skill in wisdom, mindfulness, realization, intelligence, propriety, interest, and armor by which bodhisattva great beings may make irreversible progress toward unsurpassed and perfect awakening, and from that unsurpassed and perfect awakening know no debasement or decline?

source: ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པའི་སྤྱོད་པས་བྱུང་བ་ལགས།
en: “How do bodhisattva great beings come into being due to the actions of the thus-gone ones?

source: ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ལ་བརྩོན་འགྲུས་སྦྱངས་པ་ལགས།
en: How do they train diligently in the wisdom of the thus-gone ones?

source: ཇི་ལྟར་ན་ཤེས་རབ་ཆེ་བ་ལགས།
en: How does their insight increase?

source: ཇི་ལྟར་ན་ཡེ་ཤེས་ཆེན་པོ་ལ་མཁས་པ་ལགས།
en: How are they skilled in great wisdom?

source: ཇི་ལྟར་ན་ཚུལ་ཁྲིམས་རྣམ་པར་དག་པ་ལགས།
en: How is their discipline so pure?

source: ཇི་ལྟར་ན་ཇི་ལྟར་ཐོས་པའི་ཆོས་རྣམས་མི་བསྐྱུད་པས་དྲན་པ་དང་ལྡན་པ་ལགས།
en: How is it that, in not forgetting what they have heard, they possess recollection?

source: ཇི་ལྟར་ན་དགེ་བའི་རྩ་བ་ཇི་ལྟར་བགྱིས་པ་བཞིན་དུ་སྐྱེས་པས་ཚེ་རབས་དྲན་པ་ལགས།
en: How is it that, in taking birth in accordance with their roots of virtue, they remember their past lives?

source: ཇི་ལྟར་ན་སེམས་ཅན་གཞན་ལ་སྐུལ་བས་སྔོན་གྱི་གནས་པ་ལ་མཁས་པ་ལགས།
en: “How is it that they are skilled in knowing the previous lifetimes of others and inspiring them?

source: ཇི་ལྟར་ན་དབང་པོའི་ཁྱད་པར་ལ་མཁས་པས་བློ་དང་ལྡན་པ་ལགས།
en: How is it that they are wise by being knowledgeable about differences in faculties?

source: ཇི་ལྟར་ན་མཚན་དང་ལྡན་པ་ལགས།
en: How do they possess the marks?

source: ཇི་ལྟར་ན་སངས་རྒྱས་ལ་ལྟ་བ་དང་ཆོས་ཉན་པ་དང་དགེ་འདུན་ལ་བསྙེན་བཀུར་བགྱིད་པ་དང་མི་འབྲལ་བ་ལགས།
en: How is it that they are never separate from seeing the Buddha, hearing the Dharma, or honoring the Saṅgha?

source: ཇི་ལྟར་ན་འཇིག་རྟེན་གྱི་ཁམས་གཞན་ན་བཞུགས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་མཐོང་ཞིང་།
en: How is it that they behold the blessed buddhas present in other world systems?

source: འཇིག་རྟེན་གྱི་ཁམས་མཐའ་ཡས་མུ་མ་མཆིས་པར་དེ་དག་གི་ཆོས་ཀྱང་ཐོས་ལ་ཐམས་ཅད་ཀྱང་ཀུན་ཏུ་འཛིན་ཀུན་ཆུབ་པར་བགྱིད། གཞན་ལ་ཡང་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་སྟོན་པ་ལགས།
en: How is it that they are able to hear the Dharma of those blessed ones in all the infinite world systems and then retain it, master it, and teach it truly on a vast scale?

source: ཇི་ལྟར་ན་མི་དགེ་བའི་རྩ་བ་ཐམས་ཅད་སྲེག་པས་མེ་ལྕེ་ལྟ་བུ་ལགས།
en: How is it that they are like tongues of flame in burning the roots of nonvirtue?

source: ཇི་ལྟར་ན་ཆོས་དཀར་པོ་ཐམས་ཅད་ཁོང་དུ་ཆུད་པས་ཟླ་བ་ལྟ་བུ་ལགས།
en: How is it that they are like the moon in mastering all bright phenomena?

source: ཇི་ལྟར་ན་མ་རིག་པའི་མུན་པ་ཐམས་ཅད་སེལ་བས་ཉི་མ་ལྟ་བུ་ལགས།
en: How is it that they are like the sun in dispelling all the darkness of ignorance?

source: ཇི་ལྟར་ན་དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཀྱིས་འཕགས་པས་རི་བོའི་དབང་པོའི་རྒྱལ་པོ་ལྟ་བུ་ལགས།
en: How have they become so elevated by all roots of virtue that they are like the king of mountains?

source: ཇི་ལྟར་ན་ཟབ་མོ་ལ་བཟོད་པ་མི་ཕྱེད་པས་རྡོ་རྗེ་ལྟ་བུ་ལགས།
en: How is it that they are like vajras in having unshakable acceptance of the profound?

source: ཇི་ལྟར་ན་ལྷུན་པོ་བརྩེགས་པ་དང་མཚུངས་ཤིང་འདྲ་བས་མི་འཇིགས་པ་ཐོབ་པ་ལགས།
en: “How are they fearless in being like the highest mountain?

source: ཇི་ལྟར་ན་སྤོབས་པ་ཐོགས་པ་མ་མཆིས་པས་དབྱངས་ཤིན་ཏུ་ཡོངས་སུ་དག་པ་ལགས།
en: How is it that their voices are incredibly pure by having unimpeded eloquence?

source: ཇི་ལྟར་ན་ཚིག་ཐམས་ཅད་རབ་ཏུ་དབྱེ་བ་རྣམ་པར་ངེས་པ་ལ་མཁས་པས་ཐོས་པ་མང་བ་ལགས།
en: How is it that they are exceedingly learned by being proficient in discerning and ascertaining all the different languages?

source: ཇི་ལྟར་ན་ཁྲོ་གཉེར་མ་མཆིས་ལ་བཞིན་འཛུམ་ཞིང་ཤིན་ཏུ་གསལ་བ་ལགས།
en: How is it that they do not scowl but keep their countenance smiling and radiant?

source: ཇི་ལྟར་ན་འཇིག་རྟེན་གྱི་ཆོས་ཐམས་ཅད་ཀྱིས་མ་གོས་པ་ལགས།
en: How is it that they are not contaminated by worldly phenomena?

source: ཇི་ལྟར་ན་འཇིག་རྟེན་གྱི་ཁམས་མཐའ་ཡས་པ་དབྱངས་ཀྱིས་གོ་བར་བགྱིད།
en: How is it that their voices can be heard across limitless world systems?

source: ཇི་ལྟར་ན་འཇིག་རྟེན་གྱི་ཁམས་མཐའ་ཡས་མུ་མ་མཆིས་བ་སྤུའི་ཁུང་བུ་གཅིག་ཏུ་སྩལ་ཀྱང་སེམས་ཅན་རྣམས་ཀྱིས་བདག་ཅག་གང་དུ་མཆིས་པ་ཡང་མ་འཚལ་ལ། བགྱིད་པ་དེ་ཡང་མ་འཚལ།
en: How is it that, when they show the limitless, endless world systems inside a single pore, beings do not understand where we are and do not understand what was done?

source: ཇི་ལྟར་ན་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བགྱིད་པས་ཕྱོགས་བཅུའི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་རྣམས་ན་ཡང་ཀུན་ཏུ་གདའ་ལ། གནས་ནས་ཀྱང་མི་གཡོ།
en: “How is it that, by ripening beings, they stay within the retinues of all thus-gone ones throughout the ten directions and never move from those places?

source: ཇི་ལྟར་ན་སྐྲ་ཙམ་གྱི་ཁྱོན་གཅིག་ལ་དགའ་ལྡན་གྱི་གནས་ན་གནས་པ་དང་འཆི་འཕོ་བ་དང་མངལ་དུ་འཇུག་པ་དང་བཙས་པ་དང་མངོན་པར་འབྱུང་བ་དང་དཀའ་བ་སྤྱོད་པ་ལ་སྤྱོད་པ་དང་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་མཆི་བ་དང་བདུད་ལས་རྒྱལ་བ་དང་ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྐོར་བ་དང་། ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཆེན་པོ་ཀུན་ཏུ་སྟོན་ཅིང་བསྟན་པ་གནས་པར་ཀུན་ཏུ་བསྟན་པ་ཡང་སྟོན།
en: How is it that they live in the Heaven of Joy, pass away, enter the womb, take birth, leave home, undertake austerities, sit at the seat of awakening, gain victory over demons, turn the wheel of Dharma, demonstrate passing into the great transcendence of suffering, and demonstrate teaching so that the teachings remain—all within the space of a single hair’s breadth?

source: ཇི་ལྟར་ན་སེམས་ཀྱི་སྐད་ཅིག་གཅིག་གིས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་སྤྱོད་པ་རབ་ཏུ་འཚལ་བ་ལགས།
en: How is it that they can become aware of the mental activity of all beings in a single moment of mind?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་བཟང་སྐྱོང་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །བཟང་སྐྱོང་ལེགས་སོ་ལེགས་སོ་བཟང་སྐྱོང་ཁྱོད་འདི་ལྟར་སྐྱེ་བོ་མང་པོ་ལ་ཕན་པ་དང་སྐྱེ་བོ་མང་པོ་ལ་བདེ་བའི་ཕྱིར་ཞུགས་ཤིང་།
en: The Blessed One answered the bodhisattva Bhadrapāla, “Bhadrapāla, excellent, excellent. Bhadrapāla, you have asked in this manner to benefit many beings and to bring them happiness.

source: འཇིག་རྟེན་ལ་སྙིང་བརྩེ་བ་དང་ལྷ་དང་མིའི་སྐྱེ་བོ་ཕལ་པོ་ཆེའི་དོན་དང་ཕན་པ་དང་བདེ་བའི་ཕྱིར་འདི་ལྟར་ཁྱོད་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་ཞིང་།
en: You have great compassion that loves the world and seeks to benefit ordinary beings—gods and humans alike—by accomplishing their welfare and happiness.

source: བཟང་སྐྱོང་ཁྱོད་དེ་བཞིན་གཤེགས་པ་ལ་དོན་འདི་འདྲི་བར་སེམས་པ་ནི་བཟང་སྐྱོང་ཁྱོད་ཡང་ལེགས་སོ།
en: Bhadrapāla, your intention in having asked the Blessed One such a question is excellent.

source: །བཟང་སྐྱོང་དེའི་ཕྱིར་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་ངས་བཤད་དོ།
en: Therefore, Bhadrapāla, I will answer you, so listen well and keep what I say in mind.”

source: །བྱང་ཆུབ་སེམས་དཔའ་བཟང་སྐྱོང་གིས་བཅོམ་ལྡན་འདས་ལ་ལེགས་སོ་ཞེས་གསོལ་ཏེ་བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་ཉན་པ་དང་
en: “Excellent!” the bodhisattva Bhadrapāla replied to the Blessed One, and listened in the manner that the Blessed One had instructed.

source: བཅོམ་ལྡན་འདས་ཀྱིས་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།།བཟང་སྐྱོང་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་སངས་རྒྱས་ཀྱིས་རབ་ཏུ་ཞི་བ་རྣམ་པར་ངེས་པའི་ཆོ་འཕྲུལ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: The Blessed One said, “Bhadrapāla, there is a bodhisattva activity that is the absorption that the Buddha calls the miraculous ascertainment of peace.

source: །དེ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཡོན་ཏན་གྱི་ཁྱད་པར་འདི་དག་དང་གཞན་རྣམས་ཀྱང་འཐོབ་བོ།
en: Bodhisattva great beings who dwell in that absorption attain, in addition to many others, the following special qualities.

source: །བཟང་སྐྱོང་རབ་ཏུ་ཞི་བ་རྣམ་པར་ངེས་པའི་ཆོ་འཕྲུལ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན།
en: “So, Bhadrapāla, what is this absorption called the miraculous ascertainment of peace?

source: འདི་ལྟ་སྟེ།
en: It is like this.

source: ཆོས་ཐམས་ཅད་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཁོང་དུ་ཆུད་པ་དང་མཚན་ཉིད་རབ་ཏུ་རྟོགས་པ་དང་ཕྱིན་ཅི་ལོག་གི་མཚན་ཉིད་ཡང་དག་པར་འཇོམས་པ་དང་།
en: It is to understand all phenomena in accordance with their actual nature, comprehend their characteristics, and overcome mistaken characteristics.
